<h3> การทำงานกับ Text File </h3>
<?php
    /* 
    ========== คำสั่งในการทำงานกับ Text File ===========

        fopen()     ใช้เปิดไฟล์ขึ้นมาทำงาน โดยมี 3 โหลดคือ  
                    "r"     =  Read     อ่านอย่างเดียว
                    "w"     =  Write    สร้างไฟล์ใหม่และเขียนไฟล์
                    "a"     =  Append   เขียนเพิ่มไฟล์ที่มีอยู่แล้ว

        fclose()    ปิดไฟล์เมื่อใช้งานเสร็จ

        fgets()     ดึงข้อมูลทีละบรรทัด

        fputs()     ใส่ข้อมูล หรือใช้ fwrite()

    */



    //----- ทดลองเปิดอ่านไฟล์ด้วยโหมด "r" -----

    $f = @fopen("test1.txt", "r") or die("ไม่พบระบุ");

    while ( ! feof($f)  ) 
    {
        $data =  fgets( $f );
        echo $data."<br>";
    }

    fclose($f);


    //----- ทดลองเปิดอ่านไฟล์ด้วยโหมด "w" -----

    $f = @fopen("test2.txt", "w") or die("ไม่พบระบุ");

    fwrite($f, "สมชาย \n");
    fwrite($f, "สมศรี \n");
    fwrite($f, "สมปอง \n");

    fclose($f);



    //----- ทดลองเปิดอ่านไฟล์ด้วยโหมด "w" -----

    $f = @fopen("test3.txt", "a") or die("ไม่พบระบุ");

    fwrite($f, "แดง \n");
    fwrite($f, "ขาว \n");
    fwrite($f, "ฟ้า \n");

    fclose($f);



    //----- ทดลองเปิดอ่านไฟล์ด้วยโหมด "r" -----

    echo "<h3> ข้อมูลพนักงาน </h3>";
    $f = @fopen("test4.txt", "r") or die("ไม่พบระบุ");
    while ( ! feof($f)  ) 
    {
        $data = fgets( $f );
        $arr = explode( ":", $data ); //แยกสตริงออกจากกันด้วย : แล้วกลายเป็นอาเรย์
        echo "รหัส: ".$arr[0]."<br>";
        echo "ชื่อ: ".$arr[1]."<br>";
        echo "สกุล: ".$arr[2]."<br>";
        echo "อายุ: ".$arr[3]."<br>";
        echo "ตำแหน่ง: ".$arr[4]."<br>";
        echo "เงินเดือน: ".$arr[5]."<hr>";
    }
    fclose($f);



?>