<?php
//การใช้งานตัวแปรอาเรย์ (Array)

$a = array(70, 2500,99,25); //แบบเก่า
$b = ["ไทย","จีน"]; //แบบใหม่
echo $b[0]." มีประชากร ".$a[0]." ล้านคน ";
?>
<br>

<?php
//จงประกาศตัวแปร สำหรับเก็บข้อมูล ชื่อผลไม้ และราคาผลไม้ 4รายการ

$price = array(10, 20,30,40);
$fruit = array ("มะม่วง","มังคุด","ลิ้นจี่","สตอเบอรี่");

$num = count($price);
echo"ผลไม้ทั้งสิ้น $num รายการ<br>";
for($i=0; $i<$num ;$i++)
{
echo $fruit[$i]." ราคา ".$price[$i]." บาท<br> ";
}


//----- ทดลองนำค่าในอาเรย์มาแสดงเป็น DropDown -----

echo "<select>";
for ( $i = 0;   $i < $num;   $i++ )
{
    echo "<option>" . $fruit[$i] . "</option>";
}
echo "</select>";

?>